snlkuharlocal/src/DataProcessors/ПроверкаКорректностиНабораЛН/ПроверкаКорректностиНабораЛН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаКорректностиНабораЛН</name>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОшибокСотрудников/ВидыОшибокСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОшибокСотрудников</name>
  <enumValues>
    <name>Пересорт</name>
  </enumValues>
  <enumValues>
    <name>НеВернаяУкладкаВКороб</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ПроверкаКорректностиНабораЛН/ObjectModule.bsl
процедура Сформировать(ТаблицаПараметров=Неопределено) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ различные
	|	ЛистНабора.Ссылка КАК ЛН,
	|	ЛистНабора.ДокОснование КАК ДокОснование
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.ДокОснование.Проведен
	|	И ЛистНабора.Дата >= &Дата
	|	И ((НЕ ЛистНабора.ДокОснование.НомерЗаказа ЕСТЬ NULL )
	|			ИЛИ (НЕ ЛистНабора.ДокОснование.СкладПолучатель ЕСТЬ NULL ))
	|	И ЛистНабора.ТипШК <> &ТипШК
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокОснование";
	если дата2=ПустаяДата() тогда
		запрос.УстановитьПараметр("Дата",НачалоНедели(ТекущаяДата()));
	иначе
		запрос.УстановитьПараметр("Дата",Дата2);
	КонецЕсли;
	
	запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Коробка);
	результат=запрос.Выполнить().Выбрать();
	ПараметрыСеанса.ЗапущенаОбработка=Истина;
	
	пока результат.Следующий() цикл
		ЕстьОшибкаСборки=ПроверитьКорректностьСборкиЛН(результат.ЛН,результат.ДокОснование);
		если ЕстьОшибкаСборки тогда
			ЛНОб=результат.ЛН.получитьобъект();
			//если ложь тогда
			//	ЛНОб=Документы.ЛистНабора.НайтиПоНомеру("").ПолучитьОбъект();
			//КонецЕсли;
			СтрТЧ=ЛНОб.ОшибкиСотрудников.Найти(Перечисления.ВидыОшибокСотрудников.НеВернаяУкладкаВКороб);
			если СтрТЧ=Неопределено тогда
				СтрТЧ=ЛНОб.ОшибкиСотрудников.Добавить();
				СтрТЧ.ВидОшибки=Перечисления.ВидыОшибокСотрудников.НеВернаяУкладкаВКороб;
				СтрТЧ.Количество=1;
			иначе
				СтрТЧ.Количество=СтрТЧ.Количество+1;	
			КонецЕсли;
			ЛНОб.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
	
	  ПараметрыСеанса.ЗапущенаОбработка=Ложь;
	
	
КонецПроцедуры




Функция ПроверитьКорректностьСборкиЛН(ЛН,ДокОснование)
	ПоКМП=ложь;
	если ДокОснование.метаданные().Имя="Расходная накладная" тогда
		если ДокОснование.отгрузкакомплектов тогда
			ПоКМП=Истина;
		КонецЕсли;
	КонецЕсли;
	ТЗ=ЛН.товары.выгрузить();
	тз.свернуть("Номенклатура","Количество");
	
	если ПоКМП тогда
		ТЗНакладной=ДокОснование.комплектующие.выгрузить();
		ТЗНакладной.свернуть("Номенклатура","Количество");
	иначе
		ТЗНакладной=ДокОснование.товары.выгрузить();
		ТЗНакладной.свернуть("Номенклатура","Количество");		
	КонецЕсли;
	
	
	для каждого СтрТЗ из тз цикл
		СтрТЗнакладной=ТЗНакладной.найти(СтрТЗ.номенклатура);
		если СтрТЗнакладной=Неопределено тогда Продолжить;КонецЕсли;
		КолКор=?(СтрТЗнакладной.номенклатура.родитель.ШтукВКоробке=0,СтрТЗнакладной.количество,Цел(СтрТЗнакладной.количество/СтрТЗнакладной.номенклатура.родитель.ШтукВКоробке));
		КолБлоч=СтрТЗнакладной.количество-КолКор*?(СтрТЗнакладной.номенклатура.родитель.ШтукВКоробке=0,1,СтрТЗнакладной.номенклатура.родитель.ШтукВКоробке);
		если СтрТЗ.количество<КолБлоч тогда
			Возврат Истина;
		КонецЕсли;			
	КонецЦикла;
	
	возврат ложь;
	
КонецФункции
